Repository: Werozel/tennis-finder
Catalog: translations/*/LC_MESSAGES/messages.po
Languages: ru

source: Please log in to view this page.
ru: Пожалуйста, войдите в систему, чтобы просмотреть эту страницу.

source: Name
ru: Имя

source: Game date
ru: Время игры

source: Create
ru: Создать

source: You already joined this match
ru: Вы уже присоединились к этому матчу

source: Full name
ru: Имя

source: Profile image
ru: Изображение профиля

source: Email
ru: Эл. адрес

source: Phone
ru: Телефон

source: Sign Up
ru: Зарегистрироваться

source: Invalid phone number
ru: Неправильный номер телефона

source: This phone number is taken
ru: Этот номер телефона уже зарегистрирован

source: Account with this email already exists
ru: Учетная запись с этим адресом уже существует

source: Login
ru: Войти

source: Password
ru: Пароль

source: Remember me
ru: Запомнить меня

source: Confirm password
ru: Подтвердить Пароль

source: Login can only contain letters, numbers, underscores and dashes
ru: Логин может содержать только буквы, числа, подчеркивание и тире

source: This username is already taken
ru: Это имя пользователя уже зарегистрировано

source: Passwords doesn't match!
ru: Пароли не совпадают!

source: NTRP 2.0 - New player
ru: NTRP 2.0 - новый игрок

source: Has no or limited tennis experience and is still working primarily on getting the ball into play.
ru: Не имеет или имеет ограниченный опыт игры в теннис и по-прежнему работает в основном над удержанием мяча в игре.

source: NTRP 2.5 - Beginner
ru: NTRP 2.5 - Новичок

source: Learning to judge where the ball is going. Can sustain a short rally of slow pace with other players of the same ability.
ru: Учится определять, куда летит мяч. Может выдержать короткий розыгрыш в медленном темпе с другими игроками своего уровня.

source: NTRP 3.0 - Beginner to intermediate
ru: NTRP 3.0 - Между новичком и средним уровнем

source: Fairly consistent when hitting medium-paced shots, but is not comfortable with all strokes and lacks execution when trying for directional control, depth or power.
ru: Достаточно стабильный при выполнении ударов в среднем темпе, но не стабилен в остальных ударах. Ему не хватает мастерства для контроля направления, глубины или мощности удара.

source: NTRP 3.5 - Intermediate player
ru: NTRP 3.5 - Игрок среднего игрок

source: Has good stroke dependability with directional control on shots, but still lacks depth and variety. Starting to exhibit more aggressive net play and has improved court coverage.
ru: Имеет хорошую стабильность ударов с контролем направления, но ему все еще не хватает мастерства для контроля глубины и разнообразия ударов. Начинает демонстрировать более агрессивную игру у сетки и неплохо передвигается по корту.

source: NTRP 4.0 - Intermediate to advanced player
ru: NTRP 4.0 - От среднего до продвинотого уровня

source: Dependable strokes, including directional intent, on both forehand and backhand sides on moderate shots, plus the ability to use lobs, overheads, approach shots and volleys with some success.
ru: Надежные удары с контролем направления мяча, как справа, так и слева при умеренных ударах, а также возможность с некоторым успехом использовать обводящие, удары над головой, атакующие удары и удары с лета.

source: NTRP 4.5 - Advanced player
ru: NTRP 4.5 - Продвинутый игрок

source: This player has begun to master the use of power and spins and is beginning to handle pace, has sound footwork, can control depth of shots, and is beginning to vary tactics according to opponents. This player can hit first serves with power and accuracy and place the second serve and is able to rush the net successfully.
ru: Этот игрок начал успешно контрллировать силу и вращение ударов и может управлять темпом игры, имеет хорошую работу ног, может контролировать глубину ударов и начинает варьировать тактику в зависимости от противников. Этот игрок может подавать первую подачу с силой и точностью, выполнять вторую подачу и может успешно выходить к сетке.

source: NTRP 5.0 - Elite player
ru: NTRP 5.0 - Элитный игрок

source: This player has good shot anticipation and frequently has an outstanding shot or attribute around which a game may be structured. This player can regularly hit winners or force errors off of short balls, can put away volleys, can successfully execute lobs, drop shots, half volleys and overhead smashes, and has good depth and spin on most second serves.
ru: Этот игрок хорошо оценивает направление мяча и часто обладает выдающимися навыками вокруг которых может быть построена игра. Этот игрок может регулярно пробивать навылет или провоцировать ошибки при коротких розыгрышах, может отражать удары с лета, может успешно выполнять навесы, укороченные, а также имеет хорошую глубину и вращение на большинстве вторых подач.

source: Incorrect login!
ru: Неверный логин!

source: Error
ru: Ошибка

source: Bad request!
ru: Неверный запрос!

source: Forbidden
ru: Нет доступа

source: You can't access this!
ru: Нет доступа

source: Not found
ru: Не найдено

source: 404 Not found!
ru: 404 Не найдено!

source: Something went wrong!
ru: Что-то пошло не так!

source: Create game
ru: Создать игру

source: Already have an account?
ru: Уже есть учетная запись?

source: Sign in
ru: Войти

source: Edit profile
ru: Редактировать профиль

source: More info on NTRP rating
ru: Больше информации о рейтинге NTRP

source: here
ru: здесь

source: Save
ru: Сохранять

source: Find game
ru: Найти игру

source: Find match
ru: Найти матч

source: Create match
ru: Создать матч

source: No matches here yet!
ru: Еще нет матчей!

source: Choose winner
ru: Выберите победителя

source: Choose
ru: Выбрать

source: Close
ru: Закрыть

source: Join
ru: Присоединиться

source: NTRP rating
ru: Рейтинг NTRP

source: Win rate
ru: Процент побед

source: Time
ru: Время

source: Don't have an account?
ru: Нет учетной записи?

source: Sign up
ru: Зарегистрироваться

source: Tennis
ru: Теннис

source: My matches
ru: Мои матчи

source: Profile
ru: Профиль

source: Log out
ru: Выйти

source: Log in
ru: Авторизоваться

source: Pending matches
ru: Ожидают соперника

source: Matches in progress
ru: Идущие матчи

source: Completed matches
ru: Завершенные матчи

source: Wins
ru: Победы

source: Losses
ru: Поражения

source: Registration
ru: Регистрация

source: Join now
ru: Зарегистрироваться

source: This field is required.
ru: Это поле обязательно к заполнению.

source: File does not have an approved extension: {extensions}
ru: Неправильный формат файла, принимаемые файлы: {extensions}

source: File does not have an approved extension.
ru: Неправильный формат файла

source: File must be between {min_size} and {max_size} bytes.
ru: Файл должен быть между {min_size} и {max_size} байтов.

source: Invalid field name '%s'.
ru: Неверное имя поля '%s'.

source: Field must be equal to %(other_name)s.
ru: Поле должно быть равным %(другое_name) s.

source: Field must be at least %(min)d character long.
ru: Поле должно быть длиннее %(min)d символа

source: Field cannot be longer than %(max)d character.
ru: Поле не может быть длиннее %(max)d символа

source: Field must be exactly %(max)d character long.
ru: Поле должно быть длинной %(max)d символа

source: Field must be between %(min)d and %(max)d characters long.
ru: Поле должно быть длины между %(min)d и %(max)d символами.

source: Number must be at least %(min)s.
ru: Число должно быть не менее %(min)s.

source: Number must be at most %(max)s.
ru: Число не должно превышать %(max)s.

source: Number must be between %(min)s and %(max)s.
ru: Количество должно быть между %(min)s и %(max)s.

source: Invalid input.
ru: Неверный ввод.

source: Invalid email address.
ru: Неверный адрес электронной почты.

source: Invalid IP address.
ru: Неверный IP-адрес.

source: Invalid Mac address.
ru: Неверный MAC-адрес.

source: Invalid URL.
ru: Неверная ссылка.

source: Invalid UUID.
ru: Недействительный uuid.

source: Invalid value, must be one of: %(values)s.
ru: Неверное значение, должно быть одним из: %(values)s.

source: Invalid value, can't be any of: %(values)s.
ru: Неверное значение, не может быть любым из: %(values)s.

source: Invalid CSRF Token.
ru: Неверный токен CSRF.

source: CSRF token missing.
ru: Токен CSRF отсутствует.

source: CSRF failed.
ru: Неправильный CSRF.

source: CSRF token expired.
ru: Закончился срок действия токена CSRF.

source: Invalid Choice: could not coerce.
ru: Неверный выбор.

source: Choices cannot be None.
ru: Выбор не может быть пустым

source: Not a valid choice.
ru: Неправильное значение выбора.

source: Invalid choice(s): one or more data inputs could not be coerced.
ru: Неверный выбор (s): один или несколько входов данных неправильны.

source: '%(value)s' is not a valid choice for this field.
ru: Неправильное значние поля: %(value)s

source: Not a valid datetime value.
ru: Недействительное значение даты и времени.

source: Not a valid date value.
ru: Недействительное значение даты.

source: Not a valid time value.
ru: Недостоверное значение времени.

source: Not a valid integer value.
ru: Недействительное целочисленное значение.

source: Not a valid decimal value.
ru: Недействительное десятичное значение.

source: Not a valid float value.
ru: Недопустимое значение поплавка.
